#I  number of primitive groups of degree 4 and O'Nan-Scott type 1: 2

#I  
#I  [ 1, 2, "A4" ]
#I  rank : 2
#I  1 : 2 done .. 

#I  
#I  [ 2, 2, "S4" ]
#I  rank : 2
#I  2 : 2 done .. 


# ####################################################################################################
# Flag-transitive 2-designs 
# Primitive groups on 4 points 
# ####################################################################################################
# Remark:       there exists no 2-design admitting Flag-transitive and point-primitive automorphism group
# References:    

# 1. number of non-isomorphic designs: 
# ------------------------------------

# ------------------------------------------------------
#                      Symmetric  Non-symmetric  Total  
# ------------------------------------------------------
# Point-primitive      0          0              0      
# Point-imprimitive    0          0              0      
#                                                       
# Block-primitive      0          0              0      
# Block-imprimitive    0          0              0      
#                                                       
# Flag-transitive      0          0              0      
# AntiFlag-transitive  0          0              0      
# ------------------------------------------------------
# Total                0          0              0      
# ------------------------------------------------------

# 2. Summary: 
# -----------

#    Non-isomorphic designs:
# --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
# Nr  v  b  r  k  λ  G  Gα  GB  Aut(D)  rk(G)  rk(Aut(D))  nr(G)  nr(Gα)  nr(GB)  point-primitive  block-primitive  flag-transitive  antiflag-transitive  complement  symmetric  comments  
# --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#                                                                                                                                                                                             
# --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

#    All designs:
# --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
# Nr  v  b  r  k  λ  G  Gα  GB  Aut(D)  rk(G)  rk(Aut(D))  nr(G)  nr(Gα)  nr(GB)  point-primitive  block-primitive  flag-transitive  antiflag-transitive  complement  symmetric  comments  
# --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#                                                                                                                                                                                             
# --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

# 3. Further information (up to isomorphism): 
# -------------------------------------------

# 4. Designs (up to isomorphism): 
# -------------------------------

lD_4 := [  ];
for D in lD_4 do D.blocks := Set( Orbit( D.autSubgroup , D.baseBlock , OnSets ) ); od; 

# 5. Designs (all): 
# -----------------

lD_4_all := [  ];
for D in lD_4_all do D.blocks := Set( Orbit( D.autSubgroup , D.baseBlock , OnSets ) ); od; 

